In [1]:
import pandas as pd

In [3]:
dados = pd.read_csv('auto-mpg-original.csv', sep = ';')
dados.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,"18,00","8,00","307,00","130,00","3504,00","12,00","70,00","1,00",chevrolet chevelle malibu
1,"15,00","8,00","350,00","165,00","3693,00","11,50","70,00","1,00",buick skylark 320
2,"18,00","8,00","318,00","150,00","3436,00","11,00","70,00","1,00",plymouth satellite
3,"16,00","8,00","304,00","150,00","3433,00","12,00","70,00","1,00",amc rebel sst
4,"17,00","8,00","302,00","140,00","3449,00","10,50","70,00","1,00",ford torino

In [4]:
dados.shape

(406, 9)

In [7]:
dados.isnull().sum().sum()

14

In [8]:
406 - 14

392

In [36]:
dados['mpg'] = dados['mpg'].str.replace(",",".")
dados['cylinders'] = dados['cylinders'].str.replace(",",".")
dados['displacement'] = dados['displacement'].str.replace(",",".")
dados['horsepower'] = dados['horsepower'].str.replace(",",".")
dados['weight'] = dados['weight'].str.replace(",",".")
dados['acceleration'] = dados['acceleration'].str.replace(",",".")

In [37]:
dados.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.00,8.00,307.00,130.00,3504.00,12.00,"70,00","1,00",chevrolet chevelle malibu
1,15.00,8.00,350.00,165.00,3693.00,11.50,"70,00","1,00",buick skylark 320
2,18.00,8.00,318.00,150.00,3436.00,11.00,"70,00","1,00",plymouth satellite
3,16.00,8.00,304.00,150.00,3433.00,12.00,"70,00","1,00",amc rebel sst
4,17.00,8.00,302.00,140.00,3449.00,10.50,"70,00","1,00",ford torino

In [38]:
dados['mpg'] = dados['mpg'].astype(float)
dados['cylinders'] = dados['cylinders'].astype(float)
dados['displacement'] = dados['displacement'].astype(float)
dados['horsepower'] = dados['horsepower'].astype(float)
dados['weight'] = dados['weight'].astype(float)
dados['acceleration'] = dados['acceleration'].astype(float)

In [39]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     406 non-null    float64
 2   displacement  406 non-null    float64
 3   horsepower    400 non-null    float64
 4   weight        406 non-null    float64
 5   acceleration  406 non-null    float64
 6   model year    406 non-null    object
 7   origin        406 non-null    object
 8   car name      406 non-null    object
dtypes: float64(6), object(3)
memory usage: 28.7+ KB

In [47]:
dados.groupby('model year')['mpg'].max()

model year
70,00    27.0
71,00    35.0
72,00    28.0
73,00    29.0
74,00    32.0
75,00    33.0
76,00    33.0
77,00    36.0
78,00    43.1
79,00    37.3
80,00    46.6
81,00    39.1
82,00    44.0
Name: mpg, dtype: float64

In [48]:
dados.dropna(inplace = True)

In [49]:
dados.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration
count,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000
mean,23.445918,5.471939,388.348214,509.354592,2977.584184,15.541327
std,7.805007,1.705783,302.431814,334.078508,849.402560,2.758864
min,9.000000,3.000000,97.500000,100.000000,1613.000000,8.000000
25%,17.000000,4.000000,145.750000,147.250000,2225.250000,13.775000
50%,22.750000,4.000000,260.000000,650.000000,2803.500000,15.500000
75%,29.000000,8.000000,443.500000,840.000000,3614.750000,17.025000
max,46.600000,8.000000,980.000000,980.000000,5140.000000,24.800000

In [54]:
dados['car name'].value_counts()

amc matador            5
ford pinto             5
toyota corolla         5
toyota corona          4
amc hornet             4
                      ..
buick skyhawk          1
chevrolet monza 2+2    1
ford mustang ii        1
pontiac astro          1
chevy s-10             1
Name: car name, Length: 301, dtype: int64

In [55]:
dados.corr()

,mpg,cylinders,displacement,horsepower,weight,acceleration
mpg,1.000000,-0.777618,0.403576,0.552285,-0.832244,0.423329
cylinders,-0.777618,1.000000,-0.238708,-0.709525,0.897527,-0.504683
displacement,0.403576,-0.238708,1.000000,0.084837,-0.381734,0.173959
horsepower,0.552285,-0.709525,0.084837,1.000000,-0.643922,0.402398
weight,-0.832244,0.897527,-0.381734,-0.643922,1.000000,-0.416839
acceleration,0.423329,-0.504683,0.173959,0.402398,-0.416839,1.000000

In [61]:
dados['car name'].value_counts()

amc matador            5
ford pinto             5
toyota corolla         5
toyota corona          4
amc hornet             4
                      ..
buick skyhawk          1
chevrolet monza 2+2    1
ford mustang ii        1
pontiac astro          1
chevy s-10             1
Name: car name, Length: 301, dtype: int64

In [71]:
import matplotlib.pyplot as plt

dados.bar(x = dados['mpg'], y = dados['model year'])

AttributeError: 'DataFrame' object has no attribute 'bar'